devdnl/dnx-rtos/src/system/drivers/spi/stm32f1/spi.c
/*=========================================================================*//**
@file    spi.c

@author  Daniel Zorychta

@brief   SPI driver

@note    Copyright (C) 2013 Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the  Free Software  Foundation;  either version 2 of the License, or
         any later version.

         This  program  is  distributed  in the hope that  it will be useful,
         but  WITHOUT  ANY  WARRANTY;  without  even  the implied warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         You  should  have received a copy  of the GNU General Public License
         along  with  this  program;  if not,  write  to  the  Free  Software
         Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.


*//*==========================================================================*/

#ifdef __cplusplus
extern "C" {
#endif

/*==============================================================================
  Include files
==============================================================================*/
#include "system/dnxmodule.h"
#include "system/thread.h"
#include "stm32f1/spi_cfg.h"
#include "stm32f1/spi_def.h"
#include "stm32f1/stm32f10x.h"

/*==============================================================================
  Local macros
==============================================================================*/
#define MUTEX_TIMOUT                    MAX_DELAY
#define MAX_NUMBER_OF_CS                8


#define MTX_BLOCK_TIME                  10
#define force_lock_mutex(mtx)           while (lock_mutex(mtx, 10) != MUTEX_LOCKED)
#define force_lock_recursive_mutex(mtx) while (lock_recursive_mutex(mtx, 10) != MUTEX_LOCKED)

#define SET_REG_BIT(reg, bits)          reg |=  (bits)
#define CLR_REG_BIT(reg, bits)          reg &= ~(bits)

#define SPI_CR1_BR_CALC(div)            (((div) << 3) & SPI_CR1_BR)

#define is_16_bit_frame(spi)            ((spi)->CR1 & SPI_CR1_DFF)
#define is_8_bit_frame(spi)             (!is_16_bit_frame(spi))
#define is_tx_buffer_empty(spi)         ((spi)->SR & SPI_SR_TXE)
#define is_rx_buffer_not_empty(spi)     ((spi)->SR & SPI_SR_RXNE)

#define DMA_CHAIN_NUMBER                3

/*==============================================================================
  Local object types
==============================================================================*/
/* configuration of single CS line (port and pin) */
struct cs_pin_cfg {
        GPIO_t *const           port;
        u16_t                   pin_mask;
};

/* independent SPI instance */
struct spi_virtual {
        u8_t                    major;
        u8_t                    minor;
        struct SPI_config       config;
        dev_lock_t              file_lock;
};

/* general module data */
struct module {
        mutex_t                *device_protect_mtx[_SPI_DEV_NUMBER];
        u8_t                    number_of_virtual_spi[_SPI_DEV_NUMBER];
};

/*==============================================================================
  Local function prototypes
==============================================================================*/
static stdret_t spi_turn_on     (SPI_t *spi);
static stdret_t spi_turn_off    (SPI_t *spi);

/*==============================================================================
  Local objects
==============================================================================*/
/* SPI peripherals address */
static SPI_t *const spi[_SPI_DEV_NUMBER] = {
#if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0)
        SPI1,
#endif
#if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0)
        SPI2,
#endif
#if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0)
        SPI3,
#endif
};

/* CS port configuration */
static const struct cs_pin_cfg spi_cs_pin_cfg[_SPI_DEV_NUMBER][MAX_NUMBER_OF_CS] = {
#if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0)
        {{port: _SPI1_CS0_PORT, pin_mask: (1 << _SPI1_CS0_PIN)},
         {port: _SPI1_CS1_PORT, pin_mask: (1 << _SPI1_CS1_PIN)},
         {port: _SPI1_CS2_PORT, pin_mask: (1 << _SPI1_CS2_PIN)},
         {port: _SPI1_CS3_PORT, pin_mask: (1 << _SPI1_CS3_PIN)},
         {port: _SPI1_CS4_PORT, pin_mask: (1 << _SPI1_CS4_PIN)},
         {port: _SPI1_CS5_PORT, pin_mask: (1 << _SPI1_CS5_PIN)},
         {port: _SPI1_CS6_PORT, pin_mask: (1 << _SPI1_CS6_PIN)},
         {port: _SPI1_CS7_PORT, pin_mask: (1 << _SPI1_CS7_PIN)}},
#endif
#if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0)
        {{port: _SPI2_CS0_PORT, pin_mask: (1 << _SPI2_CS0_PIN)},
         {port: _SPI2_CS1_PORT, pin_mask: (1 << _SPI2_CS1_PIN)},
         {port: _SPI2_CS2_PORT, pin_mask: (1 << _SPI2_CS2_PIN)},
         {port: _SPI2_CS3_PORT, pin_mask: (1 << _SPI2_CS3_PIN)},
         {port: _SPI2_CS4_PORT, pin_mask: (1 << _SPI2_CS4_PIN)},
         {port: _SPI2_CS5_PORT, pin_mask: (1 << _SPI2_CS5_PIN)},
         {port: _SPI2_CS6_PORT, pin_mask: (1 << _SPI2_CS6_PIN)},
         {port: _SPI2_CS7_PORT, pin_mask: (1 << _SPI2_CS7_PIN)}},
#endif
#if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0)
        {{port: _SPI3_CS0_PORT, pin_mask: (1 << _SPI3_CS0_PIN)},
         {port: _SPI3_CS1_PORT, pin_mask: (1 << _SPI3_CS1_PIN)},
         {port: _SPI3_CS2_PORT, pin_mask: (1 << _SPI3_CS2_PIN)},
         {port: _SPI3_CS3_PORT, pin_mask: (1 << _SPI3_CS3_PIN)},
         {port: _SPI3_CS4_PORT, pin_mask: (1 << _SPI3_CS4_PIN)},
         {port: _SPI3_CS5_PORT, pin_mask: (1 << _SPI3_CS5_PIN)},
         {port: _SPI3_CS6_PORT, pin_mask: (1 << _SPI3_CS6_PIN)},
         {port: _SPI3_CS7_PORT, pin_mask: (1 << _SPI3_CS7_PIN)}}
#endif
};

/* default SPI config */
static const struct SPI_config spi_default_cfg = {
        dummy_byte : _SPI_DEFAULT_CFG_DUMMY_BYTE,
        clk_divider: _SPI_DEFAULT_CFG_CLK_DIVIDER,
        mode       : _SPI_DEFAULT_CFG_MODE,
        msb_first  : _SPI_DEFAULT_CFG_MSB_FIRST
};

/* pointers to memory of specified device */
static struct module *spi_module;

/*==============================================================================
  Exported objects
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_INIT(SPI, void **device_handle, u8_t major, u8_t minor)
{
        if (major >= _SPI_DEV_NUMBER)
                return STD_RET_ERROR;

#if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0)
        if (major == _SPI_DEV_1 && minor >= _SPI1_NUMBER_OF_SLAVES)
                return STD_RET_ERROR;
#endif

#if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0)
        if (major == _SPI_DEV_2 && minor >= _SPI2_NUMBER_OF_SLAVES)
                return STD_RET_ERROR;
#endif

#if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0)
        if (major == _SPI_DEV_3 && minor >= _SPI3_NUMBER_OF_SLAVES)
                return STD_RET_ERROR;
#endif

        /* allocate module general data if initialized first time */
        if (!spi_module) {
                spi_module = calloc(1, sizeof(struct module));
                if (!spi_module)
                        return STD_RET_ERROR;
        }

        /* create protection mutex and start device if initialized first time */
        if (!spi_module->device_protect_mtx[major]) {
                spi_module->device_protect_mtx[major] = mutex_new(MUTEX_NORMAL);
                if (!spi_module->device_protect_mtx[major]) {
                        return STD_RET_ERROR;
                } else {
                        /* TODO start SPI clock etc */
                }
        }

        /* create new instance for specified major-minor number (virtual spi) */
        struct spi_virtual *hdl = calloc(1, sizeof(struct spi_virtual));
        if (!hdl) {
                return STD_RET_ERROR;
        }

        hdl->config     = spi_default_cfg;
        hdl->major      = major;
        hdl->minor      = minor;
        *device_handle  = hdl;

        spi_module->number_of_virtual_spi[major]++;

        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_RELEASE(SPI, void *device_handle)
{
        STOP_IF(!device_handle);

        struct spi_virtual *hdl = device_handle;

