devdnl/dnx-rtos/src/system/drivers/spi/stm32f1/spi.c
        stdret_t status = STD_RET_ERROR;

        critical_section_begin();
        if (device_is_unlocked(hdl->file_lock)) {

                spi_module->number_of_virtual_spi--;

                /* deinitialize major device if all minor devices are deinitialized */
                if (spi_module->number_of_virtual_spi == 0) {
                        mutex_delete(spi_module->device_protect_mtx[hdl->major]);
                        spi_module->device_protect_mtx = NULL;
                        spi_turn_off(spi[hdl->major]);
                }

                /* free module memory if all devices are deinitialized */
                bool free_module_mem = true;
                for (int i = 0; i < _SPI_DEV_NUMBER && free_module_mem; i++) {
                        free_module_mem = spi_module->device_protect_mtx[i] == NULL;
                }

                if (free_module_mem) {
                        free(spi_module);
                        spi_module = NULL;
                }

                /* free virtual spi memory */
                free(hdl);

                status = STD_RET_OK;
        }
        critical_section_end();

        return status;
}

//==============================================================================
/**
 * @brief Open device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_OPEN(SPI, void *device_handle, int flags)
{
        STOP_IF(!device_handle);

        struct spi_virtual *hdl = device_handle;

        return device_lock(&hdl->file_lock) ? STD_RET_OK : STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Close device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 * @param[in ]          *opened_by_task         task with opened this device (valid only if force is true)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_CLOSE(SPI, void *device_handle, bool force, const task_t *opened_by_task)
{
        STOP_IF(!device_handle);
        UNUSED_ARG(opened_by_task);

        struct spi_virtual *hdl = device_handle;

        if (device_is_access_granted(&hdl->file_lock)) {
                device_unlock(&hdl->file_lock, force);
                return STD_RET_OK;
        } else {
                return STD_RET_ERROR;
        }
}

//==============================================================================
/**
 * @brief Write data to device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 *
 * @return number of written bytes, -1 if error
 */
//==============================================================================
API_MOD_WRITE(SPI, void *device_handle, const u8_t *src, size_t count, u64_t *fpos)
{
        UNUSED_ARG(fpos);

        STOP_IF(device_handle == NULL);
        STOP_IF(src == NULL);
        STOP_IF(count == 0);

        struct spi_virtual *hdl = device_handle;

        ssize_t n = -1;

        if (mutex_lock(spi_module->device_protect_mtx[hdl->major], MUTEX_TIMOUT)) {
                spi_apply_config(hdl);
                spi_select_slave(hdl);

                /* TODO */

                spi_deselect_slave(hdl);
                spi_apply_safe_config();
                mutex_unlock(spi_module->device_protect_mtx[hdl->major]);
        } else {
                errno = ETIME;
        }

        return n;
}

//==============================================================================
/**
 * @brief Device read
 */
//==============================================================================
MODULE__DEVICE_READ(SPI)
{
        UNUSED_ARG(lseek);

        STOP_IF(device_handle == NULL);
        STOP_IF(dst == NULL);
        STOP_IF(item_size == 0);
        STOP_IF(n_items == 0);

        SPI_handle *hdl = device_handle;

        size_t n = 0;
        if (lock_recursive_mutex(hdl->file_lock, MTX_BLOCK_TIME) == MUTEX_LOCKED) {

#if   (SPI_HANDLER_MODE == 0)
                if (!hdl->I2S_mode) {
                        uint   size    = n_items * item_size;
                        u8_t  *data8b  = dst;
                        u16_t *data16b = dst;

                        if (is_16_bit_frame(hdl->SPI)) {
                                size &= ~(1 << 0);
                        }

                        while (size) {
                                while (!is_tx_buffer_empty(hdl->SPI));

                                hdl->SPI->DR = hdl->dummy_frame;

                                while (!(hdl->SPI->SR & SPI_SR_RXNE));
                                if (is_16_bit_frame(hdl->SPI)) {
                                        *(data16b++) = hdl->SPI->DR;
                                } else {
                                        *(data8b++) = hdl->SPI->DR;
                                }

                                size--;
                                n++;
                        }
#elif (SPI_HANDLER_MODE == 1)
#elif (SPI_HANDLER_MODE == 2)
#else
#error "Unknown SPI handler mode! Check configuration."
#endif
                }
                unlock_recursive_mutex(hdl->file_lock);
        }

        return n;
}

//==============================================================================
/**
 * @brief Device flush
 */
//==============================================================================
MODULE__DEVICE_FLUSH(SPI)
{
        STOP_IF(device_handle == NULL);

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Device ioctl
 */
//==============================================================================
MODULE__DEVICE_IOCTL(SPI)
{
        STOP_IF(device_handle == NULL);

        SPI_handle *hdl    = device_handle;
        stdret_t    status = STD_RET_ERROR;

        if (lock_recursive_mutex(hdl->file_lock, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                status = STD_RET_OK;

                switch (iorq) {
                case SPI_IORQ_SET_DUMMY_FRAME:
                        hdl->dummy_frame = va_arg(args, int);
                        break;

                case SPI_IORQ_ENABLE_8_BIT_FRAME:
                        CLR_REG_BIT(hdl->SPI->CR1, SPI_CR1_DFF);
                        break;

                case SPI_IORQ_ENABLE_16_BIT_FRAME:
                        SET_REG_BIT(hdl->SPI->CR1, SPI_CR1_DFF);
                        break;

                case SPI_IORQ_LSB_FIRST:
                        SET_REG_BIT(hdl->SPI->CR1, SPI_CR1_LSBFIRST);
                        break;

                case SPI_IORQ_MSB_FIRST:
                        CLR_REG_BIT(hdl->SPI->CR1, SPI_CR1_LSBFIRST);
                        break;

                case SPI_IORQ_CAPTURE_ON_FIRST_EDGE:
                        CLR_REG_BIT(hdl->SPI->CR1, SPI_CR1_CPHA);
                        break;

                case SPI_IORQ_CAPTURE_ON_SECOND_EDGE:
                        SET_REG_BIT(hdl->SPI->CR1, SPI_CR1_CPHA);
                        break;

