devdnl/dnx-rtos/src/system/drivers/spi/stm32f1/spi.c
                case SPI_IORQ_CLOCK_LOW_WHEN_IDLE:
                        CLR_REG_BIT(hdl->SPI->CR1, SPI_CR1_CPOL);
                        break;

                case SPI_IORQ_CLOCK_HIGH_WHEN_IDLE:
                        SET_REG_BIT(hdl->SPI->CR1, SPI_CR1_CPOL);
                        break;

                case SPI_IORQ_ENABLE_MASTER_MODE:
                        SET_REG_BIT(hdl->SPI->CR1, SPI_CR1_MSTR);
                        break;

                case SPI_IORQ_ENABLE_SLAVE_MODE:
                        CLR_REG_BIT(hdl->SPI->CR1, SPI_CR1_MSTR);
                        break;

                case SPI_IORQ_SET_CLOCK_DIVIDER:
                        CLR_REG_BIT(hdl->SPI->CR1, SPI_CR1_BR);
                        SET_REG_BIT(hdl->SPI->CR1, SPI_CR1_BR_CALC(va_arg(args, int)));
                        break;

                case SPI_IORQ_ENABLE_SW_SLAVE_MANAGEMENT:
                        SET_REG_BIT(hdl->SPI->CR1, SPI_CR1_SSM);
                        break;

                case SPI_IORQ_DISABLE_SW_SLAVE_MANAGEMENT:
                        CLR_REG_BIT(hdl->SPI->CR1, SPI_CR1_SSM);
                        break;

                case SPI_IORQ_UNIDIRECTIONAL_DATA_MODE:
                        CLR_REG_BIT(hdl->SPI->CR1, SPI_CR1_BIDIMODE);
                        break;

                case SPI_IORQ_BIDIRECTIONAL_DATA_MODE:
                        SET_REG_BIT(hdl->SPI->CR1, SPI_CR1_BIDIMODE);
                        break;

                case SPI_IORQ_RECEIVE_ONLY_IN_BD_MODE:
                        CLR_REG_BIT(hdl->SPI->CR1, SPI_CR1_BIDIOE);
                        break;

                case SPI_IORQ_TRANSMIT_ONLY_IN_BD_MODE:
                        SET_REG_BIT(hdl->SPI->CR1, SPI_CR1_BIDIOE);
                        break;

                case SPI_IORQ_TURN_ON:
                        hdl->I2S_mode = false;
                        CLEAR_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_I2SMOD | SPI_I2SCFGR_I2SE);
                        SET_REG_BIT(hdl->SPI->CR1, SPI_CR1_SPE);
                        break;

                case SPI_IORQ_TURN_OFF:
                        CLR_REG_BIT(hdl->SPI->CR1, SPI_CR1_SPE);
                        break;

                case SPI_IORQ_ENABLE_SS_OUTPUT:
                        SET_REG_BIT(hdl->SPI->CR2, SPI_CR2_SSOE);
                        break;

                case SPI_IORQ_DISABLE_SS_OUTPUT:
                        CLR_REG_BIT(hdl->SPI->CR2, SPI_CR2_SSOE);
                        break;

                case SPI_IORQ_SHIFT_WORD: {
                        u16_t *frame = va_arg(args, u16_t*);
                        if (!frame) {
                                status = STD_RET_ERROR;
                        } else {
                                while (!is_tx_buffer_empty(hdl->SPI));
                                hdl->SPI->DR = (*frame) & 0xFFFF;
                                while (!(hdl->SPI->SR & SPI_SR_RXNE));
                                *frame = hdl->SPI->DR;
                        }
                        break;
                }

                case I2S_IORQ_DISABLE_I2S:
                        RCC->APB1RSTR |=  RCC_APB1RSTR_SPI2RST;
                        RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI2RST;

                        CLEAR_BIT(hdl->SPI->CR1, SPI_CR1_SPE);
                        CLEAR_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_I2SE);
                        break;

                case I2S_IORQ_ENABLE_I2S:
                        CLEAR_BIT(hdl->SPI->CR1, SPI_CR1_SPE);
                        SET_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_I2SMOD);
                        SET_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_I2SE);
                        hdl->I2S_mode = true;

                        NVIC_EnableIRQ(DMA1_Channel5_IRQn);
                        SET_BIT(hdl->SPI->CR2, SPI_CR2_TXDMAEN);
                        DMA1_Channel5->CPAR = (u32_t)&hdl->SPI->DR;
                        DMA1_Channel5->CCR   = DMA_CCR5_MINC
                                             | DMA_CCR5_DIR
                                             | DMA_CCR5_PSIZE_0
                                             | DMA_CCR5_MSIZE_0
                                             | DMA_CCR5_TCIE;
                        break;

                case I2S_IORQ_SLAVE_TRANSMIT:
                        CLEAR_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_I2SCFG);
                        break;

                case I2S_IORQ_SLAVE_RECEIVE:
                        CLEAR_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_I2SCFG);
                        SET_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_I2SCFG_0);
                        break;

                case I2S_IORQ_MASTER_TRANSMIT:
                        CLEAR_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_I2SCFG);
                        SET_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_I2SCFG_1);
                        break;

                case I2S_IORQ_MASTER_RECEIVE:
                        SET_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_I2SCFG_1 | SPI_I2SCFGR_I2SCFG_0);
                        break;

                case I2S_IORQ_SET_I2S_DIVIDER: {
                        int divider = va_arg(args, int);
                        divider &= SPI_I2SPR_I2SDIV;
                        CLEAR_BIT(hdl->SPI->I2SPR, SPI_I2SPR_I2SDIV);
                        SET_BIT(hdl->SPI->I2SPR, divider);
                        break;
                }

                case I2S_IORQ_SET_ODD_FACTOR:
                        SET_BIT(hdl->SPI->I2SPR, SPI_I2SPR_ODD);
                        break;

                case I2S_IORQ_CLEAR_ODD_FACTOR:
                        CLEAR_BIT(hdl->SPI->I2SPR, SPI_I2SPR_ODD);
                        break;

                case I2S_IORQ_ENABLE_MASTER_CLOCK_OUTPUT:
                        SET_BIT(hdl->SPI->I2SPR, SPI_I2SPR_MCKOE);
                        break;

                case I2S_IORQ_DISABLE_MASTER_CLOCK_OUTPUT:
                        CLEAR_BIT(hdl->SPI->I2SPR, SPI_I2SPR_MCKOE);
                        break;

                case I2S_IORQ_PCMSYNC_SHORT_FRAME:
                        CLEAR_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_PCMSYNC);
                        break;

