devdnl/dnx-rtos/src/system/drivers/spi/stm32f1/spi.c
                case I2S_IORQ_PCMSYNC_LONG_FRAME:
                        SET_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_PCMSYNC);
                        break;

                case I2S_IORQ_PHILIPS_STANDARD:
                        CLEAR_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_I2SSTD);
                        break;

                case I2S_IORQ_MSB_JUSTIFIED_STANDARD:
                        CLEAR_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_I2SSTD);
                        SET_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_I2SSTD_0);
                        break;

                case I2S_IORQ_LSB_JUSTIFIED_STANDARD:
                        CLEAR_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_I2SSTD);
                        SET_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_I2SSTD_1);
                        break;

                case I2S_IORQ_PCM_STANDARD:
                        SET_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_I2SSTD_1 | SPI_I2SCFGR_I2SSTD_0);
                        break;

                case I2S_IORQ_CLOCK_STEADY_LOW:
                        CLEAR_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_CKPOL);
                        break;

                case I2S_IORQ_CLOCK_STEADY_HIGH:
                        SET_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_CKPOL);
                        break;

                case I2S_IORQ_16_BIT_DATA_LENGTH:
                        CLEAR_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_DATLEN);
                        break;

                case I2S_IORQ_24_BIT_DATA_LENGTH:
                        CLEAR_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_DATLEN);
                        SET_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_DATLEN_0);
                        break;

                case I2S_IORQ_32_BIT_DATA_LENGTH:
                        CLEAR_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_DATLEN);
                        SET_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_DATLEN_1);
                        break;

                case I2S_IORQ_16_BIT_WIDE_CHANNEL:
                        CLEAR_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_CHLEN);
                        break;

                case I2S_IORQ_32_BIT_WIDE_CHANNEL:
                        SET_BIT(hdl->SPI->I2SCFGR, SPI_I2SCFGR_CHLEN);
                        break;

                default:
                        status = STD_RET_ERROR;
                        break;
                }

                unlock_recursive_mutex(hdl->file_lock);
        }

        return status;
}

//==============================================================================
/**
 * @brief Device info
 */
//==============================================================================
MODULE__DEVICE_INFO(SPI)
{
        STOP_IF(device_handle == NULL);
        STOP_IF(device_info == NULL);

        device_info->st_size = 0;

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function enable SPI interface
 *
 * @param[in] *spi      spi peripheral
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t spi_turn_on(SPI_t *spi)
{
        switch ((uint32_t)spi) {
#if defined(RCC_APB2ENR_SPI1EN) && (SPI_1_ENABLE > 0)
        case SPI1_BASE:
                RCC->APB2ENR |= RCC_APB2ENR_SPI1EN;
                break;
#endif
#if defined(RCC_APB1ENR_SPI2EN) && (SPI_2_ENABLE > 0)
        case SPI2_BASE:
                RCC->APB1ENR |= RCC_APB1ENR_SPI2EN;
                break;
#endif
#if defined(RCC_APB1ENR_SPI3EN) && (SPI_3_ENABLE > 0)
        case SPI3_BASE:
                RCC->APB1ENR |= RCC_APB1ENR_SPI3EN;
                break;
#endif
        default:
                return STD_RET_ERROR;
        }

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function disable SPI interface
 *
 * @param[in] *spi      spi peripheral
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t spi_turn_off(SPI_t *spi)
{
        switch ((uint32_t)spi) {
#if defined(RCC_APB2ENR_SPI1EN) && (SPI_1_ENABLE > 0)
        case SPI1_BASE:
                RCC->APB2RSTR |=  RCC_APB2RSTR_SPI1RST;
                RCC->APB2RSTR &= ~RCC_APB2RSTR_SPI1RST;
                RCC->APB2ENR  &= ~RCC_APB2ENR_SPI1EN;
                break;
#endif
#if defined(RCC_APB1ENR_SPI2EN) && (SPI_2_ENABLE > 0)
        case SPI2_BASE:
                RCC->APB1RSTR |=  RCC_APB1RSTR_SPI2RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI2RST;
                RCC->APB1ENR  &= ~RCC_APB1ENR_SPI2EN;
                break;
#endif
#if defined(RCC_APB1ENR_SPI3EN) && (SPI_3_ENABLE > 0)
        case SPI3_BASE:
                RCC->APB1RSTR |=  RCC_APB1RSTR_SPI3RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI3RST;
                RCC->APB1ENR  &= ~RCC_APB1ENR_SPI3EN;
                break;
#endif
        default:
                return STD_RET_ERROR;
        }

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function write data to FIFO
 */
//==============================================================================
static int write_I2S_FIFO(struct chain_fifo *fifo, const u16_t *bfr, uint size)
{
        if (!fifo || !bfr || !size)
                return 1;

        if(fifo->level < DMA_CHAIN_NUMBER) {
                fifo->buffer[fifo->wr_idx] = bfr;
                fifo->bsize[fifo->wr_idx]  = size;

                if (++fifo->wr_idx >= DMA_CHAIN_NUMBER)
                        fifo->wr_idx = 0;

                fifo->level++;

                return 0;
        }

        return 1;
}

//==============================================================================
/**
 * @brief Function read data from FIFO
 */
//==============================================================================
static int read_I2S_FIFO(struct chain_fifo *fifo, const u16_t **bfr, uint *size)
{
        if (!fifo || !bfr || !size)
                return 1;

