devdnl/dnx-rtos/src/system/drivers/spi/stm32f1/spi.c
        if (fifo->level > 0) {
                *bfr  = fifo->buffer[fifo->rd_idx];
                *size = fifo->bsize[fifo->rd_idx];

                fifo->buffer[fifo->rd_idx] = NULL;
                fifo->bsize[fifo->rd_idx]  = 0;

                if (++fifo->rd_idx >= DMA_CHAIN_NUMBER)
                        fifo->rd_idx = 0;

                fifo->level--;

                return 0;
        }

        return 1;
}

//==============================================================================
/**
 * @brief Function
 */
//==============================================================================
void DMA1_Channel5_IRQHandler(void)
{
        DMA1->IFCR = DMA_IFCR_CTCIF5;
        CLEAR_BIT(DMA1_Channel5->CCR, DMA_CCR5_EN);

        const u16_t *bfr  = NULL;
        uint         size = 0;
        if (read_I2S_FIFO(&SPI_data[SPI_DEV_2]->I2S_chain, &bfr, &size) == 0) {
                STOP_IF(bfr == NULL);
                STOP_IF(size == 0);

                DMA1_Channel5->CMAR  = (u32_t) bfr;
                DMA1_Channel5->CNDTR = (u32_t) size;
                SET_BIT(DMA1_Channel5->CCR, DMA_CCR5_EN);

                SPI_data[SPI_DEV_2]->I2S_chain.DMA_started = true;
        } else {
                SPI_data[SPI_DEV_2]->I2S_chain.DMA_started = false;
        }

        int woke = OS_FALSE;
        give_counting_semaphore_from_ISR(SPI_data[SPI_DEV_2]->I2S_chain.semaphore, &woke);
}

#ifdef __cplusplus
}
#endif

/*==============================================================================
  End of file
==============================================================================*/
